##  Exercise 5.8

### Write a function which takes a single argument which is a matrix. The function should return a matrix which is the same as the function argument but every odd number is doubled

In [1]:

vect_1 <- c(1,1,3 ,5,2,6, -2,-1,-3)

Func <- function(vect_1){
vect_2 <- numeric()

for(num in vect_1) {
    if( num %% 2 != 0){
        vect_2 <- c(vect_2, num * 2)}else{
        vect_2 <- c(vect_2, num )
    }        
}
mt = matrix(vect_2,nrow = 3, byrow = T )
    
print(mt)
}
Func(vect_1)

     [,1] [,2] [,3]
[1,]    2    2    6
[2,]   10    2    6
[3,]   -2   -2   -6

# Exercise 5.9

### Read the file Table0.txt from http: // www. r-exercises.com/ wp-content/ uploads/ 2015/ 12/ Table0. txt. 
#### • Change the names of the columns to Name, Age, Height, Weight and Sex.
#### • Change the row names so that they are the same as Name, and remove the variable Name

In [103]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────────────────────────────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.0     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.1     ✔ tibble    3.2.0
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.1
── Conflicts ────────────────────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In [2]:
data <- data.frame(
  Name = c("Alex", "Lilly", "Mark", "Oliver", "Martha", "Lucas", "Caroline"),
  Age = c(25, 31, 23, 52, 76, 49, 26),
  Height = c(177, 163, 190, 179, 163, 183, 164),
  Weight = c(57, 69, 83, 75, 70, 83, 53),
  Gender = c("F", "F", "M", "M", "F", "M", "F")
)

write.csv(data, file = "personal_info.csv", row.names = FALSE)

In [3]:
data

  Name     Age Height Weight Gender
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Martha   76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F

In [4]:
# Read data from file
data <- read.table("http://www.r-exercises.com/wp-content/uploads/2015/12/Table0.txt", header = TRUE)

# Rename columns
names(data) <- c("Name", "Age", "Height", "Weight", "Sex")

In [5]:
data

  Name     Age Height Weight Sex
1 Lilly    31  163    69     F
2 Mark     23  190    83     M
3 Oliver   52  179    75     M
4 Martha   76  163    70     F
5 Lucas    49  183    83     M
6 Caroline 26  164    53     F

In [4]:

# Set row names to Name column and remove Name column
rownames(data) <- data$Name
data$Name <- NULL

In [5]:
data

         Age Height Weight Sex
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F

# Exercise 5.10 
For this exercise, we’ll use the (built-in) dataset VADeaths.
- Make sure the object is a data frame, if not change it to a data frame.
- Create a new variable, named Total, which is the sum of each row.
- Change the order of the columns so total is the first variable.

In [8]:
# Call the data VADeaths
data(VADeaths)

In [9]:
#View columns data
View(VADeaths)

      Rural Male Rural Female Urban Male Urban Female
50-54 11.7        8.7         15.4        8.4
55-59 18.1       11.7         24.3       13.6
60-64 26.9       20.3         37.0       19.3
65-69 41.0       30.9         54.6       35.1
70-74 66.0       54.3         71.1       50.0

In [11]:
# check type -class- of data
class(VADeaths)

[1] "data.frame"

In [13]:
# columns' name
colnames(VADeaths)

[1] "Rural Male"   "Rural Female" "Urban Male"   "Urban Female"

In [27]:
#data is in  frame, but we will check it

if(!is.data.frame(VADeaths)){
    VADeaths = as.data.frame(VADeaths)
    print("Now, Data in frame")
}else{
    print("Data exits in frame")
}

[1] "Data exits in frame"

In [29]:
# Check column sum function 
colSums(VADeaths[1])

Total
618.4

In [21]:
# Create now row named total 
VADeaths$Total <- rowSums(VADeaths)

In [22]:
# View data after create total column
View(VADeaths)

      Rural Male Rural Female Urban Male Urban Female Total
50-54 11.7        8.7         15.4        8.4          44.2
55-59 18.1       11.7         24.3       13.6          67.7
60-64 26.9       20.3         37.0       19.3         103.5
65-69 41.0       30.9         54.6       35.1         161.6
70-74 66.0       54.3         71.1       50.0         241.4

In [24]:
# reorder columns and rows,
# VADeaths[rowOrder, columnsOrder]
VADeaths = VADeaths[, c('Total', 'Rural Male', 'Rural Female', 'Urban Male', 'Urban Female')]

In [25]:
#view data after reorder columns
View(VADeaths)

      Total Rural Male Rural Female Urban Male Urban Female
50-54  44.2 11.7        8.7         15.4        8.4
55-59  67.7 18.1       11.7         24.3       13.6
60-64 103.5 26.9       20.3         37.0       19.3
65-69 161.6 41.0       30.9         54.6       35.1
70-74 241.4 66.0       54.3         71.1       50.0

## Exercise 5.11 
### Make a data frame with 3 columns and 5 rows. Make sure first column is a sequence of numbers 1:5, and second column is a character vector.

In [8]:
df <- data.frame(
  col1 = 1:5,
  col2 = c("apple", "banana", "cherry", "date", "elderberry"),
  col3 = c(TRUE, FALSE, TRUE, FALSE, TRUE)
)

# Print the data frame
df

  col1 col2       col3
1 1    apple       TRUE
2 2    banana     FALSE
3 3    cherry      TRUE
4 4    date       FALSE
5 5    elderberry  TRUE

# Exercise 5.12
### Extract the first 3 columns and first 3 rows of your matrix using [] notation.

In [43]:
# create matris contains numbers from 1 to 16
numbers = c(seq(1:16)) 
# create matrix contains numbers, number of rows = 4, number of columns = 4
mat = matrix(numbers, ncol = 4, nrow = 4, byrow = TRUE)
mat

     [,1] [,2] [,3] [,4]
[1,]  1    2    3    4
[2,]  5    6    7    8
[3,]  9   10   11   12
[4,] 13   14   15   16

In [44]:
# Extract first three columns
#[row, column]
mat[,1:3]

     [,1] [,2] [,3]
[1,]  1    2    3
[2,]  5    6    7
[3,]  9   10   11
[4,] 13   14   15

In [45]:
# Extrat first 3 rows
mat[1:3,]

     [,1] [,2] [,3] [,4]
[1,] 1     2    3    4
[2,] 5     6    7    8
[3,] 9    10   11   12

# Exercise 5.13
You have measured five cylinders,
their lengths are: 2.1,3.4, 2.5, 2.7, 2.9 and 
the diameters are: 0.3, 0.5, 0.6, 0.9, 1.1 
Read these data into two vectors (give the vectors appropriate names). 
- Calculate the correlation between lengths and diameters (use the cor function).
- Calculate the volume of each cylinder (V = length ∗ pi ∗ (diameter/2))
- Calculate the mean, standard deviation, and coefficient of variation of the volumes

In [54]:
# Create vectors of lengths and diameters
lengths = c(2.1,3.4, 2.5, 2.7, 2.9 )
diameters = c(0.3, 0.5, 0.6, 0.9, 1.1)

[1] 0.3282822

In [55]:
# Correlation
cor(lengths, diameters)

[1] 0.3282822

In [63]:
# Calculate volumn
# pi is exsit value in R
Vol = (diameters/2) * lengths * pi
Vol

[1] 0.9896017 2.6703538 2.3561945 3.8170351 5.0108403

In [64]:
# mean of volumes
mean(Vol)

[1] 2.968805

In [69]:
# standard deviation of volumes
sd(Vol)

[1] 1.522417

In [74]:
# coefficient of variation of volumes
coeffVol = (sd(Vol) / mean(Vol)) * 100
coeffVol

[1] 51.28046

# Exercise 5.14 
Write a function that takes 3 numbers a, b, and c as inputs
and returns the smallest number of the three.

In [78]:
# input x, y, z
x = readline()
y = readline()
z = readline()

1
2
3

In [79]:
# Out min in x, y, z
min(x,y,z)

[1] "1"

# Exercise 5.15
Write a function that takes an array of numbers x and returns the smallest number in the array.

In [89]:
# Fucntion
MinNumInArray <- function(arr){
    return(min(arr))
}

In [91]:
# Call function
arr = array(c(1, 2, 3, -1))
MinNumInArray(arr)

[1] -1

# Exercise 5.16 
### Write a function which recursively computes the n’th Fibonacci numb

In [100]:
# fibonacci function
fib <- function(n){
    if (n <= 1){
        return(n)
    }else{
    return(fib(n - 1) + fib(n - 2))
    }
}

In [101]:
# fibonacci of 3
fib(3)

[1] 2

# Exercise 5.17 Find the bug:

In [104]:
# 1) The bug is commented and correction in code

# x <- 0:9 >> x <- seq(0:9)
x <- seq(0:9)
# if(x[1] = 1
if(x[1] == 1){
    print(x)
}

 [1]  1  2  3  4  5  6  7  8  9 10

In [108]:
#2)
myfactorial <- function(x)
{
    #  if(x = 1)
    # curly brackets
    if(x == 1){
        return(1)} else{
        return (x * myfactorial(x))}
}

In [114]:
#3)
f <- function(n,p = -1){
    if(sqrt(p)== 1)
        #1
        return(1)
    else
        #0
        return(0)
}
f(1)

Warning message in sqrt(p):
"NaNs produced"

ERROR: Error in if (sqrt(p) == 1) return(1) else return(0): missing value where TRUE/FALSE needed

# Exercise 5.18 
The following data are 10 days rainfall amounts. Read
them into a vector. Calculate the following:
1. The mean,
2. The standard deviation,
3. The cumulative rainfall, and
4. The day with the highest rainfall.
0.1 - 0.6 - 33.8 - 1.9 - 9.6 - 4.3 - 33.7 - 0.3 - 0.0 - 0.1

In [115]:
days = c(0.1, 0.6, 33.8, 1.9, 9.6, 4.3, 33.7, 0.3, 0.0, 0.1)

In [116]:
#mean 
mean(days)

[1] 8.44

In [117]:
sd(days)

[1] 13.66473

In [119]:
# The day with the highest rainfall
## Max value in days
mx = max(days)
## Day number on days(index of day)
which(days == mx)

[1] 3

# Exercise 5.19 
You have two vectors x and y with (1,2,5,9,11) and (2,5,1,0,23)
as their elements, respectively. Calculate the following:
- Values that are contained in both x and y,
- Values that are in x but not y, and
- A vector that contains all values contained in either x or y.

In [122]:
x = c(1, 2, 5, 9, 11) 
y = c(2, 5, 1, 0, 23)

In [123]:
# Values that are contained in both x and y
intersect(x,y)

[1] 1 2 5

In [127]:
# Values that are in x but not y
x[!(x %in% y)]

[1]  9 11

In [128]:
# A vector that contains all values contained in either x or y
union(x, y)

[1]  1  2  5  9 11  0 23

# Exercise 5.20
- Create a data frame from a matrix of your choice, 
- change the row names so every row says id_i (where i is the row number) and
- change the column names to variable_i (where i is the column number).
i.e., for column 1 it will say variable_1, and for row 2 will say id_2 and
so on

In [131]:
# Create matrix of 20 numbers
mt = matrix(c(seq(1:20)), nrow = 4, byrow = TRUE)
mt

     [,1] [,2] [,3] [,4] [,5]
[1,]  1    2    3    4    5
[2,]  6    7    8    9   10
[3,] 11   12   13   14   15
[4,] 16   17   18   19   20

In [137]:
# create dataframe from matrix
df = data.frame(mt)

In [140]:
# Change column name to col+ i
colnames(df) = (c('col1', 'col2', 'col3', 'col4', 'col5'))
# change row name to id_i
rownames(df) = (c('id_1', 'id_2', 'id_3', 'id_4'))

In [141]:
df

     col1 col2 col3 col4 col5
id_1  1    2    3    4    5
id_2  6    7    8    9   10
id_3 11   12   13   14   15
id_4 16   17   18   19   20

# Exercise 5.20
- Create a data frame from a matrix of your choice, 
- change the row names so every row says id_i (where i is the row number) and
- change the column names to variable_i (where i is the column number).
i.e., for column 1 it will say variable_1, and for row 2 will say id_2 and
so on

In [157]:
# Create matrix of 20 numbers
mt = matrix(c(seq(1:100)), nrow = 10, byrow = TRUE)
# create dataframe from matrix
df = data.frame(mt)
# Change column name to col+ i
colnames(df) = (c('col1', 'col2', 'col3', 'col4', 'col5', 'col6', 'col7', 'col8', 'col9', 'col10'))
# change row name to id_i
rownames(df) = (c('id_1', 'id_2', 'id_3', 'id_4','id_5', 'id_6', 'id_7', 'id_8','id_9', 'id_10'))
df

      col1 col2 col3 col4 col5 col6 col7 col8 col9 col10
id_1   1    2    3    4    5    6    7    8    9    10
id_2  11   12   13   14   15   16   17   18   19    20
id_3  21   22   23   24   25   26   27   28   29    30
id_4  31   32   33   34   35   36   37   38   39    40
id_5  41   42   43   44   45   46   47   48   49    50
id_6  51   52   53   54   55   56   57   58   59    60
id_7  61   62   63   64   65   66   67   68   69    70
id_8  71   72   73   74   75   76   77   78   79    80
id_9  81   82   83   84   85   86   87   88   89    90
id_10 91   92   93   94   95   96   97   98   99   100

In [158]:
# Row means 
df$MeanOfRow = rowMeans(df)
df

      col1 col2 col3 col4 col5 col6 col7 col8 col9 col10 MeanOfRow
id_1   1    2    3    4    5    6    7    8    9    10    5.5
id_2  11   12   13   14   15   16   17   18   19    20   15.5
id_3  21   22   23   24   25   26   27   28   29    30   25.5
id_4  31   32   33   34   35   36   37   38   39    40   35.5
id_5  41   42   43   44   45   46   47   48   49    50   45.5
id_6  51   52   53   54   55   56   57   58   59    60   55.5
id_7  61   62   63   64   65   66   67   68   69    70   65.5
id_8  71   72   73   74   75   76   77   78   79    80   75.5
id_9  81   82   83   84   85   86   87   88   89    90   85.5
id_10 91   92   93   94   95   96   97   98   99   100   95.5

In [159]:
# Standard deviation for each row
df$StandardDivaition <- apply(df, 1, sd)
df

      col1 col2 col3 col4 col5 col6 col7 col8 col9 col10 MeanOfRow
id_1   1    2    3    4    5    6    7    8    9    10    5.5
id_2  11   12   13   14   15   16   17   18   19    20   15.5
id_3  21   22   23   24   25   26   27   28   29    30   25.5
id_4  31   32   33   34   35   36   37   38   39    40   35.5
id_5  41   42   43   44   45   46   47   48   49    50   45.5
id_6  51   52   53   54   55   56   57   58   59    60   55.5
id_7  61   62   63   64   65   66   67   68   69    70   65.5
id_8  71   72   73   74   75   76   77   78   79    80   75.5
id_9  81   82   83   84   85   86   87   88   89    90   85.5
id_10 91   92   93   94   95   96   97   98   99   100   95.5
      StandardDivaition
id_1  2.872281
id_2  2.872281
id_3  2.872281
id_4  2.872281
id_5  2.872281
id_6  2.872281
id_7  2.872281
id_8  2.872281
id_9  2.872281
id_10 2.872281

# Exercise 5.22 
Create the following data frame, afterwards invert Sex for all individuals.
10

In [30]:
Name = c('Alex', 'Lilly', 'Mark', 'Oliver', 'Matha', 'Lucas', 'Caroline')
Age = c(25, 31, 23, 52, 76, 49, 26)
Height = c(177, 163, 190, 179, 163, 183, 164)
Weight = c(57, 69, 83, 75, 70, 83, 53)
Sex = c('F', 'F', 'M', 'M', 'F', 'M', 'F')
# Create df
df = data.frame(Name, Age, Height, Weight, Sex)
df

  Name     Age Height Weight Sex
1 Alex     25  177    57     F
2 Lilly    31  163    69     F
3 Mark     23  190    83     M
4 Oliver   52  179    75     M
5 Matha    76  163    70     F
6 Lucas    49  183    83     M
7 Caroline 26  164    53     F

In [31]:
# Set Name as index
library(data.table)
setDT(df, key = "Name")

In [32]:
df

  Name     Age Height Weight Sex
1 Alex     25  177    57     F
2 Caroline 26  164    53     F
3 Lilly    31  163    69     F
4 Lucas    49  183    83     M
5 Mark     23  190    83     M
6 Matha    76  163    70     F
7 Oliver   52  179    75     M

In [33]:
Working = c('Yes','No', 'No','Yes' , 'Yes', 'No','Yes')

In [17]:
# DF2
df2 = data.frame(Name, Working)
df2

  Name     Working
1 Alex     Yes
2 Caroline No
3 Lilly    No
4 Lucas    Yes
5 Mark     Yes
6 Matha    No
7 Oliver   Yes

In [34]:
# Merge two data frames
merged = merge(df, df2, by = 'Name')
merged

  Name     Age Height Weight Sex Working
1 Alex     25  177    57     F   Yes
2 Caroline 26  164    53     F   No
3 Lilly    31  163    69     F   No
4 Lucas    49  183    83     M   Yes
5 Mark     23  190    83     M   Yes
6 Matha    76  163    70     F   No
7 Oliver   52  179    75     M   Yes

In [35]:
# number of column 
ncol(merged)

[1] 6

In [36]:
# number of row
nrow(merged)

[1] 7

In [39]:
class(df)
class(df2)
class(merged)

[1] "data.table" "data.frame"

[1] "data.frame"

[1] "data.table" "data.frame"

# Exercise 5.23

In [70]:
height = c(181, 160,174, 170, 172, 165, 161, 167, 164, 166, 162, 158, 175, 181, 180, 177, 173)
shoesize = c(44, 38, 42, 43,43, 39, 38, 38, 39, 38, 37, 36, 42, 44, 43, 43, 41)
geneder = c('Male','Female', 'Female', 'Male','Male','Female','Female','Female','Female', 'Female',
            'Female', 'Female', 'Male','Male','Male','Male','Male')
population = c('Kuopie', 'Kuopie','Kuopie','Kuopie','Kuopie','Kuopie','Kuopie','Tempere','Tempere', 
               'Tempere', 'Tempere', 'Tempere', 'Tempere', 'Tempere', 'Tempere', 'Tempere', 'Tempere')
Students = data.frame(height, shoesize, geneder, population)
Students

   height shoesize geneder population
1  181    44       Male    Kuopie
2  160    38       Female  Kuopie
3  174    42       Female  Kuopie
4  170    43       Male    Kuopie
5  172    43       Male    Kuopie
6  165    39       Female  Kuopie
7  161    38       Female  Kuopie
8  167    38       Female  Tempere
9  164    39       Female  Tempere
10 166    38       Female  Tempere
11 162    37       Female  Tempere
12 158    36       Female  Tempere
13 175    42       Male    Tempere
14 181    44       Male    Tempere
15 180    43       Male    Tempere
16 177    43       Male    Tempere
17 173    41       Male    Tempere

In [71]:
#Columns headers(names)
colnames(Students)

[1] "height"     "shoesize"   "geneder"    "population"

In [72]:
# Mean of height and shoesize
mean(Students$height)
mean(Students$shoesize)

[1] 169.7647

[1] 40.47059

In [73]:
# standard deviasion
sd(Students$height)
sd(Students$shoesize)

[1] 7.578996

[1] 2.695312

In [74]:
# Table distribtution
gender_dist <- table(Students$geneder)
gender_dist

Female   Male
     9      8

In [75]:
# Male individuals
dfMale = Students[Students$geneder == 'Male',]
# df[df$colname == 'Value',]
dfMale

   height shoesize geneder population
1  181    44       Male    Kuopie
4  170    43       Male    Kuopie
5  172    43       Male    Kuopie
13 175    42       Male    Tempere
14 181    44       Male    Tempere
15 180    43       Male    Tempere
16 177    43       Male    Tempere
17 173    41       Male    Tempere

In [82]:
# Record new varable 
Students$gender_new = ifelse(Students$geneder == 'Male', 'M', 'F')
Students

   height shoesize geneder population gender_new
1  181    44       Male    Kuopie     M
2  160    38       Female  Kuopie     F
3  174    42       Female  Kuopie     F
4  170    43       Male    Kuopie     M
5  172    43       Male    Kuopie     M
6  165    39       Female  Kuopie     F
7  161    38       Female  Kuopie     F
8  167    38       Female  Tempere    F
9  164    39       Female  Tempere    F
10 166    38       Female  Tempere    F
11 162    37       Female  Tempere    F
12 158    36       Female  Tempere    F
13 175    42       Male    Tempere    M
14 181    44       Male    Tempere    M
15 180    43       Male    Tempere    M
16 177    43       Male    Tempere    M
17 173    41       Male    Tempere    M

In [84]:
# Extract males
dfMale = Students[Students$geneder == 'Male',]
# df[df$colname == 'Value',]
dfMale
##########OR############
dfMale = Students[Students$gender_new == 'M',]
# df[df$colname == 'Value',]
dfMale

   height shoesize geneder population gender_new
1  181    44       Male    Kuopie     M
4  170    43       Male    Kuopie     M
5  172    43       Male    Kuopie     M
13 175    42       Male    Tempere    M
14 181    44       Male    Tempere    M
15 180    43       Male    Tempere    M
16 177    43       Male    Tempere    M
17 173    41       Male    Tempere    M

   height shoesize geneder population gender_new
1  181    44       Male    Kuopie     M
4  170    43       Male    Kuopie     M
5  172    43       Male    Kuopie     M
13 175    42       Male    Tempere    M
14 181    44       Male    Tempere    M
15 180    43       Male    Tempere    M
16 177    43       Male    Tempere    M
17 173    41       Male    Tempere    M

# Exercise 5.24

In [87]:
demodf = read.csv('demographics.csv')

In [88]:
demodf

    age marital   income educ                         carpr carcat   gender
1   55  Married    72    Did not complete high school 36.2  Luxury   Female
2   56  Unmarried 153    Did not complete high school 76.9  Luxury   Male
3   28  Married    28    Some college                 13.7  Economy  Female
4   24  Married    26    College degree               12.5  Economy  Male
5   25  Unmarried  23    High school degree           11.3  Economy  Male
6   45  Married    76    Some college                 37.2  Luxury   Male
7   42  Unmarried  40    Some college                 19.8  Standard Male
8   35  Unmarried  57    High school degree           28.2  Standard Female
9   46  Unmarried  24    Did not complete high school 12.2  Economy  Female
10  34  Married    89    Some college                 46.1  Luxury   Male
11  55  Married    72    Some college                 35.5  Luxury   Female
12  28  Unmarried  24    College degree               11.8  Economy  Male
13  31  Married    40    College degree               21.3  Standard Female
14  42  Unmarried 137    Some college                 68.9  Luxury   Female
15  35  Unmarried  70    Some college                 34.1  Luxury   Male
16  52  Married   159    College degree               78.9  Luxury   Male
17  21  Married    37    Some college                 18.6  Standard Male
18  32  Unmarried  28    Did not complete high school 13.7  Economy  Female
19  42  Unmarried 109    Some college                 54.7  Luxury   Female
20  40  Married   117    High school degree           58.3  Luxury   Female
21  30  Unmarried  23    Did not complete high school 11.8  Economy  Male
22  48  Unmarried  21    Some college                  9.5  Economy  Male
23  39  Married    17    College degree                8.5  Economy  Male
24  42  Married    34    High school degree           16.6  Standard Female
25  45  Married   115    Did not complete high school 57.4  Luxury   Female
26  51  Married    47    Did not complete high school 23.0  Standard Male
27  39  Married    33    Some college                 16.3  Standard Male
28  49  Unmarried 135    High school degree           68.4  Luxury   Female
29  52  Unmarried 272    Did not complete high school 74.9  Luxury   Male
30  53  Married    41    Did not complete high school 19.9  Standard Male
⋮   ⋮   ⋮         ⋮      ⋮                            ⋮     ⋮        ⋮
481 29  Unmarried  30    Some college                 14.9  Economy  Male
482 60  Married   114    College degree               57.2  Luxury   Male
483 49  Married    38    College degree               18.7  Standard Female
484 21  Unmarried  28    Some college                 13.6  Economy  Male
485 63  Unmarried  11    High school degree            5.4  Economy  Female
486 20  Unmarried  18    Some college                  9.1  Economy  Male
487 33  Unmarried  36    Did not complete high school 17.3  Standard Female
488 61  Unmarried  24    Did not complete high school 11.8  Economy  Male
489 53  Married    34    Some college                 16.5  Standard Female
490 35  Unmarried  47    Some college                 23.9  Standard Male
491 46  Unmarried  49    Did not complete high school 23.9  Standard Female
492 23  Unmarried  19    Did not complete high school  9.3  Economy  Female
493 47  Unmarried  57    High school degree           29.5  Standard Female
494 49  Married    86    High school degree           43.3  Luxury   Female
495 43  Unmarried 101    College degree               49.4  Luxury   Female
496 64  Unmarried  11    College degree                5.6  Economy  Female
497 53  Married   227    High school degree           76.3  Luxury   Male
498 32  Married    18    High school degree            9.0  Economy  Female
499 28  Married    43    College degree               21.0  Standard Female
500 25  Married    26    College degree               12.9  Economy  Female
501 31  Married    25    Post-undergraduate degree    12.4  Economy  Male
502 46  Unmarried  77    Some college                 37.6  Luxury   Female
503 34  Married    31    Did not complete high school 15.8  Standard Female
504 26  Married    23    Did not complete high school 11.7  Economy  Female
505 42  Married    41    Did not complete high school 21.2  Standard Male
506 58  Married   496    Some college                 78.6  Luxury   Female
507 55  Unmarried  89    College degree               43.8  Luxury   Male
508 63  Married    91    High school degree           45.0  Luxury   Female
509 59  Married   141    Did not complete high school 70.0  Luxury   Male
510 43  Married    54    High school degree           27.0  Standard Male
    retired
1   No
2   No
3   No
4   No
5   No
6   No
7   No
8   No
9   No
10  No
11  No
12  No
13  No
14  No
15  No
16  No
17  No
18  No
19  No
20  No
21  No
22  No
23  No
24  No
25  No
26  No
27  No
28  No
29  No
30  No
⋮   ⋮
481 No
482 No
483 No
484 No
485 Yes
486 No
487 No
488 No
489 No
490 No
491 No
492 No
493 No
494 No
495 No
496 Yes
497 No
498 No
499 No
500 No
501 No
502 No
503 No
504 No
505 No
506 No
507 No
508 No
509 No
510 No

In [90]:
head(demodf,3)

  age marital   income educ                         carpr carcat  gender
1 55  Married    72    Did not complete high school 36.2  Luxury  Female
2 56  Unmarried 153    Did not complete high school 76.9  Luxury  Male
3 28  Married    28    Some college                 13.7  Economy Female
  retired
1 No
2 No
3 No

In [91]:
colnames(demodf)

[1] "age"     "marital" "income"  "educ"    "carpr"   "carcat"  "gender"
[8] "retired"

In [92]:
class(demodf)

[1] "data.frame"

## Get all males have colege degree

In [96]:
# educ values and count
demodf %>% count(educ)

  educ                         n
1 College degree               113
2 Did not complete high school 125
3 High school degree           132
4 Post-undergraduate degree     27
5 Some college                 113

In [97]:
# Genger count and value
demodf %>% count(gender)

  gender n
1 Female 250
2 Male   260

In [99]:
demodf[demodf$gender == 'Male' & demodf$educ %in% c('College degree', 'Post-undergraduate degree', 'Some college'),]

    age marital   income educ                      carpr carcat   gender
4   24  Married     26   College degree            12.5  Economy  Male
6   45  Married     76   Some college              37.2  Luxury   Male
7   42  Unmarried   40   Some college              19.8  Standard Male
10  34  Married     89   Some college              46.1  Luxury   Male
12  28  Unmarried   24   College degree            11.8  Economy  Male
15  35  Unmarried   70   Some college              34.1  Luxury   Male
16  52  Married    159   College degree            78.9  Luxury   Male
17  21  Married     37   Some college              18.6  Standard Male
22  48  Unmarried   21   Some college               9.5  Economy  Male
23  39  Married     17   College degree             8.5  Economy  Male
27  39  Married     33   Some college              16.3  Standard Male
32  47  Married     22   Some college              11.4  Economy  Male
33  58  Unmarried   60   College degree            29.7  Standard Male
36  30  Married     21   College degree            10.5  Economy  Male
41  41  Unmarried   59   Some college              28.6  Standard Male
44  24  Unmarried   35   College degree            17.4  Standard Male
58  28  Married     31   Some college              15.6  Standard Male
61  46  Married    133   Post-undergraduate degree 66.6  Luxury   Male
63  28  Unmarried   24   Some college              12.5  Economy  Male
65  37  Unmarried   24   Some college              11.3  Economy  Male
68  51  Married     70   Some college              35.6  Luxury   Male
69  48  Married    321   Post-undergraduate degree 65.9  Luxury   Male
70  40  Unmarried   71   Some college              35.1  Luxury   Male
77  48  Married   1116   College degree            74.1  Luxury   Male
83  37  Unmarried   29   Post-undergraduate degree 14.5  Economy  Male
86  48  Unmarried  129   Some college              65.5  Luxury   Male
88  40  Married     57   College degree            29.5  Standard Male
92  32  Married     26   Some college              12.2  Economy  Male
94  47  Unmarried   28   Some college              13.7  Economy  Male
98  41  Unmarried   49   College degree            23.9  Standard Male
⋮   ⋮   ⋮         ⋮      ⋮                         ⋮     ⋮        ⋮
374 38  Married    78    Some college              39.0  Luxury   Male
375 31  Unmarried  28    Some college              13.9  Economy  Male
377 58  Unmarried  17    Post-undergraduate degree  8.4  Economy  Male
383 30  Unmarried  25    College degree            12.6  Economy  Male
386 71  Unmarried 147    College degree            74.2  Luxury   Male
389 46  Unmarried 114    College degree            57.1  Luxury   Male
396 50  Married    86    Some college              42.1  Luxury   Male
404 51  Unmarried  51    Some college              26.1  Standard Male
408 40  Married    29    Some college              14.2  Economy  Male
414 27  Unmarried 102    College degree            49.2  Luxury   Male
423 36  Unmarried  87    College degree            43.8  Luxury   Male
429 31  Married    45    Some college              22.1  Standard Male
431 54  Unmarried 151    College degree            77.5  Luxury   Male
435 53  Married   111    College degree            54.6  Luxury   Male
436 60  Married     9    Some college               4.4  Economy  Male
444 40  Unmarried  86    College degree            42.2  Luxury   Male
453 35  Unmarried 152    College degree            75.2  Luxury   Male
455 42  Married    61    Post-undergraduate degree 30.3  Luxury   Male
461 41  Unmarried 198    College degree            98.6  Luxury   Male
462 62  Married    63    College degree            31.6  Luxury   Male
470 44  Married    48    Some college              23.2  Standard Male
476 29  Married    29    Some college              14.3  Economy  Male
479 44  Married   139    College degree            70.3  Luxury   Male
481 29  Unmarried  30    Some college              14.9  Economy  Male
482 60  Married   114    College degree            57.2  Luxury   Male
484 21  Unmarried  28    Some college              13.6  Economy  Male
486 20  Unmarried  18    Some college               9.1  Economy  Male
490 35  Unmarried  47    Some college              23.9  Standard Male
501 31  Married    25    Post-undergraduate degree 12.4  Economy  Male
507 55  Unmarried  89    College degree            43.8  Luxury   Male
    retired
4   No
6   No
7   No
10  No
12  No
15  No
16  No
17  No
22  No
23  No
27  No
32  No
33  No
36  No
41  No
44  No
58  No
61  No
63  No
65  No
68  No
69  No
70  No
77  No
83  No
86  No
88  No
92  No
94  No
98  No
⋮   ⋮
374 No
375 No
377 Yes
383 No
386 Yes
389 No
396 No
404 No
408 No
414 No
423 No
429 No
431 No
435 No
436 Yes
444 No
453 No
455 No
461 No
462 No
470 No
476 No
479 No
481 No
482 No
484 No
486 No
490 No
501 No
507 No

In [101]:
# Get all retired females.
demodf[demodf$gender == 'Female',]

    age marital   income educ                         carpr carcat   gender
1   55  Married    72    Did not complete high school 36.2  Luxury   Female
3   28  Married    28    Some college                 13.7  Economy  Female
8   35  Unmarried  57    High school degree           28.2  Standard Female
9   46  Unmarried  24    Did not complete high school 12.2  Economy  Female
11  55  Married    72    Some college                 35.5  Luxury   Female
13  31  Married    40    College degree               21.3  Standard Female
14  42  Unmarried 137    Some college                 68.9  Luxury   Female
18  32  Unmarried  28    Did not complete high school 13.7  Economy  Female
19  42  Unmarried 109    Some college                 54.7  Luxury   Female
20  40  Married   117    High school degree           58.3  Luxury   Female
24  42  Married    34    High school degree           16.6  Standard Female
25  45  Married   115    Did not complete high school 57.4  Luxury   Female
28  49  Unmarried 135    High school degree           68.4  Luxury   Female
31  34  Unmarried  20    Some college                 10.0  Economy  Female
34  25  Married    58    Some college                 28.4  Standard Female
35  57  Married    92    High school degree           45.5  Luxury   Female
37  21  Unmarried  13    Some college                  6.3  Economy  Female
38  24  Unmarried  24    High school degree           11.8  Economy  Female
39  56  Unmarried 213    College degree               81.7  Luxury   Female
42  57  Married   544    High school degree           82.8  Luxury   Female
46  21  Unmarried  22    Some college                 11.0  Economy  Female
47  33  Married    39    High school degree           19.4  Standard Female
50  44  Married   240    College degree               75.2  Luxury   Female
53  48  Unmarried  78    College degree               38.0  Luxury   Female
54  25  Unmarried  68    College degree               33.5  Luxury   Female
56  38  Married    19    Did not complete high school  9.2  Economy  Female
62  43  Married   109    High school degree           54.6  Luxury   Female
64  39  Unmarried  57    Some college                 28.6  Standard Female
67  55  Unmarried  65    College degree               31.5  Luxury   Female
71  28  Unmarried  35    Some college                 17.3  Standard Female
⋮   ⋮   ⋮         ⋮      ⋮                            ⋮     ⋮        ⋮
458 31  Married    95    Some college                 47.0  Luxury   Female
463 37  Unmarried  28    Did not complete high school 13.9  Economy  Female
464 37  Unmarried  46    College degree               24.1  Standard Female
465 19  Married    20    High school degree           10.3  Economy  Female
467 41  Unmarried  69    Some college                 34.5  Luxury   Female
468 59  Married    57    Did not complete high school 29.3  Standard Female
471 53  Unmarried 129    Did not complete high school 64.7  Luxury   Female
472 37  Married    40    Did not complete high school 19.6  Standard Female
473 64  Married    15    High school degree            7.4  Economy  Female
477 51  Married    77    Some college                 38.5  Luxury   Female
478 25  Married    22    Did not complete high school 11.2  Economy  Female
480 35  Unmarried  35    High school degree           17.4  Standard Female
483 49  Married    38    College degree               18.7  Standard Female
485 63  Unmarried  11    High school degree            5.4  Economy  Female
487 33  Unmarried  36    Did not complete high school 17.3  Standard Female
489 53  Married    34    Some college                 16.5  Standard Female
491 46  Unmarried  49    Did not complete high school 23.9  Standard Female
492 23  Unmarried  19    Did not complete high school  9.3  Economy  Female
493 47  Unmarried  57    High school degree           29.5  Standard Female
494 49  Married    86    High school degree           43.3  Luxury   Female
495 43  Unmarried 101    College degree               49.4  Luxury   Female
496 64  Unmarried  11    College degree                5.6  Economy  Female
498 32  Married    18    High school degree            9.0  Economy  Female
499 28  Married    43    College degree               21.0  Standard Female
500 25  Married    26    College degree               12.9  Economy  Female
502 46  Unmarried  77    Some college                 37.6  Luxury   Female
503 34  Married    31    Did not complete high school 15.8  Standard Female
504 26  Married    23    Did not complete high school 11.7  Economy  Female
506 58  Married   496    Some college                 78.6  Luxury   Female
508 63  Married    91    High school degree           45.0  Luxury   Female
    retired
1   No
3   No
8   No
9   No
11  No
13  No
14  No
18  No
19  No
20  No
24  No
25  No
28  No
31  No
34  No
35  No
37  No
38  No
39  No
42  No
46  No
47  No
50  No
53  No
54  No
56  No
62  No
64  No
67  No
71  No
⋮   ⋮
458 No
463 No
464 No
465 No
467 No
468 No
471 No
472 No
473 Yes
477 No
478 No
480 No
483 No
485 Yes
487 No
489 No
491 No
492 No
493 No
494 No
495 No
496 Yes
498 No
499 No
500 No
502 No
503 No
504 No
506 No
508 No

In [110]:
# create a new variable 'EducationLevel'
demodf$EducationLevel <- ifelse(demodf$educ == 'Did not complete high school', 0 , 
                                ifelse(demodf$educ == 'High school degree', 1,
                                       ifelse(demodf$educ == 'Post-undergraduate degree', 3,
                                              ifelse(demodf$educ == 'Some college', 4, 5))))

# print the updated data frame
print(demodf)

    age   marital income                         educ carpr   carcat gender
1    55   Married     72 Did not complete high school  36.2   Luxury Female
2    56 Unmarried    153 Did not complete high school  76.9   Luxury   Male
3    28   Married     28                 Some college  13.7  Economy Female
4    24   Married     26               College degree  12.5  Economy   Male
5    25 Unmarried     23           High school degree  11.3  Economy   Male
6    45   Married     76                 Some college  37.2   Luxury   Male
7    42 Unmarried     40                 Some college  19.8 Standard   Male
8    35 Unmarried     57           High school degree  28.2 Standard Female
9    46 Unmarried     24 Did not complete high school  12.2  Economy Female
10   34   Married     89                 Some college  46.1   Luxury   Male
11   55   Married     72                 Some college  35.5   Luxury Female
12   28 Unmarried     24               College degree  11.8  Economy   Male
13   31   Married     40               College degree  21.3 Standard Female
14   42 Unmarried    137                 Some college  68.9   Luxury Female
15   35 Unmarried     70                 Some college  34.1   Luxury   Male
16   52   Married    159               College degree  78.9   Luxury   Male
17   21   Married     37                 Some college  18.6 Standard   Male
18   32 Unmarried     28 Did not complete high school  13.7  Economy Female
19   42 Unmarried    109                 Some college  54.7   Luxury Female
20   40   Married    117           High school degree  58.3   Luxury Female
21   30 Unmarried     23 Did not complete high school  11.8  Economy   Male
22   48 Unmarried     21                 Some college   9.5  Economy   Male
23   39   Married     17               College degree   8.5  Economy   Male
24   42   Married     34           High school degree  16.6 Standard Female
25   45   Married    115 Did not complete high school  57.4   Luxury Female
26   51   Married     47 Did not complete high school  23.0 Standard   Male
27   39   Married     33                 Some college  16.3 Standard   Male
28   49 Unmarried    135           High school degree  68.4   Luxury Female
29   52 Unmarried    272 Did not complete high school  74.9   Luxury   Male
30   53   Married     41 Did not complete high school  19.9 Standard   Male
31   34 Unmarried     20                 Some college  10.0  Economy Female
32   47   Married     22                 Some college  11.4  Economy   Male
33   58 Unmarried     60               College degree  29.7 Standard   Male
34   25   Married     58                 Some college  28.4 Standard Female
35   57   Married     92           High school degree  45.5   Luxury Female
36   30   Married     21               College degree  10.5  Economy   Male
37   21 Unmarried     13                 Some college   6.3  Economy Female
38   24 Unmarried     24           High school degree  11.8  Economy Female
39   56 Unmarried    213               College degree  81.7   Luxury Female
40   24 Unmarried     19           High school degree   9.6  Economy   Male
41   41 Unmarried     59                 Some college  28.6 Standard   Male
42   57   Married    544           High school degree  82.8   Luxury Female
43   32 Unmarried     32           High school degree  15.7 Standard   Male
44   24 Unmarried     35               College degree  17.4 Standard   Male
45   49   Married     35 Did not complete high school  17.3 Standard   Male
46   21 Unmarried     22                 Some college  11.0  Economy Female
47   33   Married     39           High school degree  19.4 Standard Female
48   56 Unmarried    134           High school degree  67.2   Luxury   Male
49   54   Married    103 Did not complete high school  51.2   Luxury   Male
50   44   Married    240               College degree  75.2   Luxury Female
51   20 Unmarried     20           High school degree   9.5  Economy   Male
52   47 Unmarried    118           High school degree  59.8   Luxury   Male
53   48 Unmarried     78               College degree  38.0   Luxury Female
54   25 Unmarried     68               College degree  33.5   Luxury Female
55   52 Unmarried     27 Did not complete high school  13.4  Economy   Male
56   38   Married     19 Did not complete high school   9.2  Economy Female
57   65   Married     20           High school degree  10.1  Economy   Male
58   28   Married     31                 Some college  15.6 Standard   Male
59   51   Married     51           High school degree  25.5 Standard   Male
60   61   Married     84           High school degree  41.5   Luxury   Male
61   46   Married    133    Post-undergraduate degree  66.6   Luxury   Male
62   43   Married    109           High school degree  54.6   Luxury Female
63   28 Unmarried     24                 Some college  12.5  Economy   Male
64   39 Unmarried     57                 Some college  28.6 Standard Female
65   37 Unmarried     24                 Some college  11.3  Economy   Male
66   59   Married     32           High school degree  15.9 Standard   Male
67   55 Unmarried     65               College degree  31.5   Luxury Female
68   51   Married     70                 Some college  35.6   Luxury   Male
69   48   Married    321    Post-undergraduate degree  65.9   Luxury   Male
70   40 Unmarried     71                 Some college  35.1   Luxury   Male
71   28 Unmarried     35                 Some college  17.3 Standard Female
72   39   Married     85           High school degree  44.0   Luxury   Male
73   30   Married     20                 Some college   9.7  Economy Female
74   40   Married     33                 Some college  16.4 Standard Female
75   55 Unmarried     35               College degree  17.2 Standard Female
76   48   Married     50           High school degree  25.2 Standard Female
77   48   Married   1116               College degree  74.1   Luxury   Male
78   49   Married     89           High school degree  44.7   Luxury Female
79   56 Unmarried    376 Did not complete high school  64.9   Luxury Female
80   44 Unmarried     54 Did not complete high school  27.3 Standard   Male
81   43 Unmarried     68           High school degree  32.9   Luxury   Male
82   61   Married    117               College degree  60.4   Luxury Female
83   37 Unmarried     29    Post-undergraduate degree  14.5  Economy   Male
84   29   Married     25           High school degree  12.5  Economy   Male
85   30   Married     27 Did not complete high school  13.1  Economy Female
86   48 Unmarried    129                 Some college  65.5   Luxury   Male
87   51   Married    140 Did not complete high school  70.6   Luxury   Male
88   40   Married     57               College degree  29.5 Standard   Male
89   66   Married     30 Did not complete high school  15.5 Standard Female
90   61   Married     23           High school degree  11.3  Economy   Male
91   61   Married     64                 Some college  32.0   Luxury Female
92   32   Married     26                 Some college  12.2  Economy   Male
93   25 Unmarried     27           High school degree  13.4  Economy   Male
94   47 Unmarried     28                 Some college  13.7  Economy   Male
95   59   Married    209           High school degree  76.8   Luxury Female
96   25   Married     27           High school degree  13.8  Economy Female
97   63   Married    478 Did not complete high school  73.0   Luxury   Male
98   41 Unmarried     49               College degree  23.9 Standard   Male
99   66 Unmarried     30           High school degree  14.3  Economy   Male
100  20 Unmarried     36                 Some college  17.5 Standard   Male
101  47   Married     62                 Some college  31.2   Luxury   Male
102  42 Unmarried     49 Did not complete high school  24.5 Standard Female
103  35   Married     49               College degree  24.3 Standard Female
104  24 Unmarried     23               College degree  11.9  Economy   Male
105  22 Unmarried     23               College degree  11.5  Economy Female
106  32   Married     59    Post-undergraduate degree  29.8 Standard   Male
107  50   Married     58 Did not complete high school  29.2 Standard   Male
108  44   Married     46 Did not complete high school  23.2 Standard   Male
109  32 Unmarried     31               College degree  15.4 Standard   Male
110  65 Unmarried     40 Did not complete high school  20.9 Standard Female
111  47   Married    181           High school degree  90.4   Luxury Female
112  42 Unmarried     53               College degree  25.4 Standard Female
113  48 Unmarried    144           High school degree  72.7   Luxury Female
114  29 Unmarried     22               College degree  10.9  Economy   Male
115  36 Unmarried     43           High school degree  20.2 Standard   Male
116  34 Unmarried     23           High school degree  11.4  Economy Female
117  41 Unmarried     68               College degree  34.3   Luxury Female
118  26 Unmarried     41           High school degree  20.9 Standard   Male
119  25 Unmarried     23               College degree  11.5  Economy   Male
120  53 Unmarried    145           High school degree  70.9   Luxury   Male
121  32   Married     33           High school degree  16.8 Standard Female
122  46 Unmarried     83           High school degree  40.5   Luxury Female
123  44   Married     39 Did not complete high school  19.2 Standard Female
124  39 Unmarried     42               College degree  20.6 Standard Female
125  39   Married     43 Did not complete high school  22.3 Standard Female
126  40 Unmarried     38               College degree  18.9 Standard Female
127  25 Unmarried     59               College degree  28.4 Standard Female
128  29   Married     57           High school degree  28.7 Standard   Male
129  23 Unmarried     24               College degree  11.8  Economy   Male
130  48 Unmarried     45 Did not complete high school  22.7 Standard   Male
131  24 Unmarried     22           High school degree  10.6  Economy   Male
132  59 Unmarried     30                 Some college  14.5  Economy   Male
133  31   Married     30           High school degree  15.1 Standard Female
134  70 Unmarried     21           High school degree  10.3  Economy Female
135  37 Unmarried     51               College degree  24.7 Standard   Male
136  59   Married     43                 Some college  21.0 Standard Female
137  38 Unmarried     30               College degree  15.2 Standard Female
138  56 Unmarried     37                 Some college  18.1 Standard   Male
139  48   Married     23 Did not complete high school  11.4  Economy Female
140  28   Married     16               College degree   7.9  Economy   Male
141  20   Married     19           High school degree   9.6  Economy   Male
142  68 Unmarried     22           High school degree  10.7  Economy   Male
143  26 Unmarried     38               College degree  18.6 Standard   Male
144  29   Married     74               College degree  37.3   Luxury Female
145  23   Married     13           High school degree   6.4  Economy   Male
146  61 Unmarried     41                 Some college  20.2 Standard   Male
147  39 Unmarried     48 Did not complete high school  25.6 Standard Female
148  47   Married    176               College degree  88.9   Luxury Female
149  36 Unmarried     40               College degree  20.4 Standard   Male
150  61 Unmarried    837           High school degree  73.4   Luxury   Male
151  32   Married     71               College degree  35.4   Luxury   Male
152  28   Married     30               College degree  14.4  Economy   Male
153  66   Married     42           High school degree  19.9 Standard Female
154  35   Married     51 Did not complete high school  25.4 Standard   Male
155  55   Married    352               College degree  67.7   Luxury   Male
156  47 Unmarried    122               College degree  60.4   Luxury Female
157  34   Married     38                 Some college  19.6 Standard   Male
158  29 Unmarried     67           High school degree  34.2   Luxury   Male
159  36 Unmarried     31                 Some college  15.6 Standard   Male
160  38   Married     51                 Some college  25.9 Standard   Male
161  33   Married     35               College degree  17.3 Standard   Male
162  46   Married     88           High school degree  42.7   Luxury Female
163  29 Unmarried     60               College degree  30.4   Luxury Female
164  38   Married     53                 Some college  25.0 Standard Female
165  38 Unmarried     42           High school degree  20.5 Standard   Male
166  39   Married     29 Did not complete high school  14.3  Economy Female
167  34   Married     62    Post-undergraduate degree  31.0   Luxury   Male
168  58   Married     46           High school degree  22.2 Standard   Male
169  29 Unmarried     31 Did not complete high school  15.4 Standard Female
170  64 Unmarried     16               College degree   8.1  Economy   Male
171  41 Unmarried     36                 Some college  18.2 Standard   Male
172  44 Unmarried     25 Did not complete high school  11.9  Economy Female
173  60   Married     82 Did not complete high school  40.3   Luxury Female
174  32 Unmarried     25               College degree  12.7  Economy Female
175  35 Unmarried     37                 Some college  18.6 Standard   Male
176  58   Married     19           High school degree   9.6  Economy   Male
177  37 Unmarried     30           High school degree  15.0 Standard Female
178  63   Married    208           High school degree  83.1   Luxury Female
179  22   Married     25                 Some college  12.1  Economy Female
180  66   Married     72           High school degree  34.8   Luxury Female
181  26 Unmarried     19 Did not complete high school   9.4  Economy   Male
182  44 Unmarried    104           High school degree  51.0   Luxury Female
183  41 Unmarried     25           High school degree  12.4  Economy Female
184  26   Married     15 Did not complete high school   7.6  Economy   Male
185  48 Unmarried    371               College degree  74.6   Luxury Female
186  45 Unmarried    135 Did not complete high school  67.6   Luxury Female
187  26   Married     50           High school degree  25.3 Standard   Male
188  31 Unmarried     22 Did not complete high school  11.2  Economy Female
189  54   Married    354           High school degree  70.7   Luxury   Male
190  34   Married     38               College degree  18.3 Standard   Male
191  32   Married     45 Did not complete high school  22.1 Standard   Male
192  35 Unmarried     32           High school degree  15.7 Standard Female
193  22   Married     32           High school degree  16.2 Standard   Male
194  25 Unmarried     30                 Some college  14.6  Economy   Male
195  59   Married    103           High school degree  51.2   Luxury Female
196  28   Married     15    Post-undergraduate degree   7.5  Economy Female
197  37   Married     52           High school degree  25.4 Standard Female
198  43 Unmarried     29 Did not complete high school  14.0  Economy   Male
199  42   Married     69           High school degree  34.1   Luxury Female
200  35 Unmarried     38           High school degree  19.0 Standard Female
201  22 Unmarried     32 Did not complete high school  15.7 Standard   Male
202  55 Unmarried    298               College degree  80.5   Luxury   Male
203  63 Unmarried     11 Did not complete high school   5.6  Economy   Male
204  40   Married     61                 Some college  31.7   Luxury   Male
205  29 Unmarried     59 Did not complete high school  29.4 Standard   Male
206  32   Married     52 Did not complete high school  25.6 Standard Female
207  47 Unmarried    138               College degree  69.2   Luxury   Male
208  42 Unmarried     28                 Some college  13.9  Economy Female
209  50 Unmarried     23 Did not complete high school  11.7  Economy Female
210  52   Married     34                 Some college  16.9 Standard Female
211  33   Married     26 Did not complete high school  13.1  Economy Female
212  54 Unmarried    286               College degree  73.6   Luxury   Male
213  37   Married     32 Did not complete high school  15.9 Standard Female
214  57   Married    307               College degree  73.5   Luxury Female
215  70   Married     11           High school degree   5.5  Economy   Male
216  23   Married     14               College degree   6.9  Economy Female
217  55 Unmarried    196                 Some college  98.2   Luxury Female
218  48 Unmarried     81           High school degree  41.1   Luxury   Male
219  38 Unmarried     40           High school degree  20.1 Standard   Male
220  47   Married     65 Did not complete high school  32.5   Luxury   Male
221  29 Unmarried     21               College degree  10.5  Economy   Male
222  27   Married     26                 Some college  13.1  Economy   Male
223  29   Married     40                 Some college  19.8 Standard Female
224  28 Unmarried     26 Did not complete high school  12.6  Economy   Male
225  47   Married     55                 Some college  27.2 Standard Female
226  45   Married     22                 Some college  11.1  Economy Female
227  24 Unmarried     19                 Some college   9.6  Economy   Male
228  41   Married    204           High school degree  67.9   Luxury Female
229  18 Unmarried     13           High school degree   6.6  Economy   Male
230  42 Unmarried    140                 Some college  69.9   Luxury Female
231  45   Married     46               College degree  23.1 Standard   Male
232  34   Married     40    Post-undergraduate degree  19.8 Standard Female
233  38   Married    105                 Some college  53.5   Luxury Female
234  36 Unmarried    137               College degree  67.5   Luxury   Male
235  19   Married     16           High school degree   7.9  Economy Female
236  28 Unmarried     24 Did not complete high school  11.9  Economy Female
237  41   Married     32           High school degree  15.7 Standard   Male
238  54 Unmarried     47               College degree  23.9 Standard Female
239  42 Unmarried    207                 Some college  70.5   Luxury Female
240  47   Married    118               College degree  58.9   Luxury   Male
241  61 Unmarried    288               College degree  70.9   Luxury Female
242  66   Married     13 Did not complete high school   6.5  Economy   Male
243  51   Married     73                 Some college  36.7   Luxury   Male
244  55 Unmarried     33 Did not complete high school  16.6 Standard Female
245  36   Married     28                 Some college  13.3  Economy   Male
246  39   Married     63                 Some college  30.7   Luxury   Male
247  38 Unmarried     30               College degree  14.5  Economy   Male
248  44   Married     89                 Some college  44.3   Luxury Female
249  52   Married     78 Did not complete high school  38.7   Luxury Female
250  55 Unmarried   1045    Post-undergraduate degree  70.9   Luxury Female
251  58   Married     97 Did not complete high school  49.1   Luxury   Male
252  61 Unmarried    119           High school degree  58.7   Luxury   Male
253  64 Unmarried     10 Did not complete high school   4.9  Economy Female
254  45   Married    242                 Some college  76.1   Luxury Female
255  66 Unmarried    333 Did not complete high school  63.2   Luxury   Male
256  31 Unmarried     29           High school degree  15.2 Standard Female
257  31 Unmarried     26           High school degree  12.6  Economy   Male
258  36   Married     56               College degree  29.4 Standard   Male
259  20 Unmarried     21                 Some college  10.6  Economy Female
260  40   Married     35                 Some college  17.3 Standard Female
261  38   Married     40           High school degree  19.3 Standard   Male
262  51 Unmarried     89           High school degree  43.0   Luxury   Male